import Image from 'next/image';
import myImage from './../images/developer.jpg';
import styles from './about.module.css';

const AboutPage = () => {
  return (
    <div className="container">
      <article className={styles.root}>
        <Image src={myImage} alt="Developer" loading="eager" />

        <div className={styles.content}>
          <p>
            Розробник — це фахівець, який займається створенням комп'ютерних
            програм, додатків, сайтів та інших цифрових продуктів. Він
            перетворює ідеї та вимоги на працюючий код, використовуючи різні
            мови програмування та технології.
          </p>

          <p>
            Робота розробника починається з аналізу поставленого завдання. Він
            обговорює з замовником або керівником проєкту бажаний результат,
            функціональність майбутнього продукту, терміни виконання. Або
            отримує вже готове технічне завдання для виконання, що трапляється
            набагато частіше.
          </p>
          <p>
            Наступний етап — безпосередньо написання коду. Розробник реалізує
            заплановану функціональність, за можливості стежачи за якістю та
            чистотою коду, оскільки це впливає на швидкість розробки.
          </p>
          <p>
            Після завершення розробки настає час тестування. Програму
            перевіряють на коректність роботи, відсутність помилок і
            вразливостей. Виявлені недоліки виправляються.
          </p>
        </div>
      </article>
    </div>
  );
};

export default AboutPage;
